contracts/noa-sample-msg-payload.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <ac:PostRq xmlns:ac="http://www.ACORD.org/Standards/AcordMsgSvc/1.4.0"
                   xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
                   xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                   xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <ac:Sender>
                <ac:PartyId>urn:duns:043352368</ac:PartyId>
                <ac:PartyRoleCd>Broker</ac:PartyRoleCd>
                <ac:PartyName>NewField US</ac:PartyName>
            </ac:Sender>
            <ac:Receiver>
                <ac:PartyId>mailto:test@your-org.com</ac:PartyId>
                <ac:PartyRoleCd>Agent</ac:PartyRoleCd>
            </ac:Receiver>
            <ac:Application>
                <ac:ApplicationCd>ACORD-PC-Surety</ac:ApplicationCd>
                <ac:SchemaVersion>http://www.ACORD.org/standards/PC_Surety/ACORD1/xml/</ac:SchemaVersion>
            </ac:Application>
            <ac:TimeStamp>2018-06-07T12:35:10</ac:TimeStamp>
            <ac:MsgItem>
                <ac:MsgId>7b3db4f0-6261-4a89-86f1-3ea0857fec9d</ac:MsgId>
                <ac:MsgTypeCd>InsuranceSvcRq</ac:MsgTypeCd>
            </ac:MsgItem>
            <ac:SecurityProfileCd>Basic</ac:SecurityProfileCd>
            <ac:WorkFolder>
                <ac:MsgFile>
                    <ac:FileId>cid:85b5c715-39ec-41b8-a645-ef7945466867</ac:FileId>
                    <ac:FileFormatCd>text/xml</ac:FileFormatCd>
                </ac:MsgFile>
                <ac:AttachmentPackages>
                    <ac:AttachmentPackage>
                        <ac:Owner>
                            <ac:PartyId>urn:duns:043352368</ac:PartyId>
                            <ac:PartyRoleCd>Broker</ac:PartyRoleCd>
                        </ac:Owner>
                        <ac:CommunicationChannelCd>in_stream</ac:CommunicationChannelCd>
                        <ac:FileId>cid:E42DCC98-C474-4824-9BCE-C354E53DAD6C</ac:FileId>
                        <ac:FileFormatCd>application/msword</ac:FileFormatCd>
                        <ac:Attachments>
                            <ac:Attachment>
                                <ac:Document>
                                    <ac:DocumentReference>4960185</ac:DocumentReference>
                                    <ac:DocumentVersion/>
                                    <ac:FileId>Services Inc_Property Template_Commercial Property Coverage.doc
                                    </ac:FileId>
                                    <ac:FileSize>
                                        <ac:NumUnits>140</ac:NumUnits>
                                        <ac:UnitMeasurementCd>KB</ac:UnitMeasurementCd>
                                    </ac:FileSize>
                                    <ac:DocumentTypeCd>correspondence</ac:DocumentTypeCd>
                                    <ac:Description>Services Inc_Property Template_Commercial Property Coverage
                                    </ac:Description>
                                </ac:Document>
                            </ac:Attachment>
                        </ac:Attachments>
                    </ac:AttachmentPackage>
                    <ac:AttachmentPackage>
                        <ac:Owner>
                            <ac:PartyId>urn:duns:043352368</ac:PartyId>
                            <ac:PartyRoleCd>Broker</ac:PartyRoleCd>
                        </ac:Owner>
                        <ac:CommunicationChannelCd>in_stream</ac:CommunicationChannelCd>
                        <ac:FileId>cid:706D0CF0-C9B5-476C-B1D0-24E003480AE6</ac:FileId>
                        <ac:FileFormatCd>application/msword</ac:FileFormatCd>
                        <ac:Attachments>
                            <ac:Attachment>
                                <ac:Document>
                                    <ac:DocumentReference>4960186</ac:DocumentReference>
                                    <ac:DocumentVersion/>
                                    <ac:FileId>Services Inc_General Introduction Template_AllLOBS.doc</ac:FileId>
                                    <ac:FileSize>
                                        <ac:NumUnits>114</ac:NumUnits>
                                        <ac:UnitMeasurementCd>KB</ac:UnitMeasurementCd>
                                    </ac:FileSize>
                                    <ac:DocumentTypeCd>correspondence</ac:DocumentTypeCd>
                                    <ac:Description>Services Inc_General Introduction Template_AllLOBS
                                    </ac:Description>
                                </ac:Document>
                            </ac:Attachment>
                        </ac:Attachments>
                    </ac:AttachmentPackage>
                    <ac:AttachmentPackage>
                        <ac:Owner>
                            <ac:PartyId>urn:duns:043352368</ac:PartyId>
                            <ac:PartyRoleCd>Broker</ac:PartyRoleCd>
                        </ac:Owner>
                        <ac:CommunicationChannelCd>in_stream</ac:CommunicationChannelCd>
                        <ac:FileId>cid:625B75E2-233F-4255-9681-ECD3944F2B2D</ac:FileId>
                        <ac:FileFormatCd>application/pdf</ac:FileFormatCd>
                        <ac:Attachments>
                            <ac:Attachment>
                                <ac:Document>
                                    <ac:DocumentReference>4960187</ac:DocumentReference>
                                    <ac:DocumentVersion/>
                                    <ac:FileId>Some Inc Acord 126_General Liability Coverage.pdf</ac:FileId>
                                    <ac:FileSize>
                                        <ac:NumUnits>98</ac:NumUnits>
                                        <ac:UnitMeasurementCd>KB</ac:UnitMeasurementCd>
                                    </ac:FileSize>
                                    <ac:DocumentTypeCd>correspondence</ac:DocumentTypeCd>
                                    <ac:Description>Some Inc Acord 126_General Liability Coverage
                                    </ac:Description>
                                </ac:Document>
                            </ac:Attachment>
                        </ac:Attachments>
                    </ac:AttachmentPackage>
                    <ac:AttachmentPackage>
                        <ac:Owner>
                            <ac:PartyId>urn:duns:043352368</ac:PartyId>
                            <ac:PartyRoleCd>Broker</ac:PartyRoleCd>
                        </ac:Owner>
                        <ac:CommunicationChannelCd>in_stream</ac:CommunicationChannelCd>
                        <ac:FileId>cid:61883B83-EA07-4420-A5A3-3151123BB61C</ac:FileId>
                        <ac:FileFormatCd>application/msword</ac:FileFormatCd>
                        <ac:Attachments>
                            <ac:Attachment>
                                <ac:Document>
                                    <ac:DocumentReference>4960188</ac:DocumentReference>
                                    <ac:DocumentVersion/>
                                    <ac:FileId>Services Inc_General Liability Template_General Liability
                                        Coverage.doc
                                    </ac:FileId>
                                    <ac:FileSize>
                                        <ac:NumUnits>252</ac:NumUnits>
                                        <ac:UnitMeasurementCd>KB</ac:UnitMeasurementCd>
                                    </ac:FileSize>
                                    <ac:DocumentTypeCd>correspondence</ac:DocumentTypeCd>
                                    <ac:Description>Services Inc_General Liability Template_General Liability
                                        Coverage
                                    </ac:Description>
                                </ac:Document>
                            </ac:Attachment>
                        </ac:Attachments>
                    </ac:AttachmentPackage>
                    <ac:AttachmentPackage>
                        <ac:Owner>
                            <ac:PartyId>urn:duns:043352368</ac:PartyId>
                            <ac:PartyRoleCd>Broker</ac:PartyRoleCd>
                        </ac:Owner>
                        <ac:CommunicationChannelCd>in_stream</ac:CommunicationChannelCd>
                        <ac:FileId>cid:A1957B7A-9DBB-4098-A366-88AAF6EEB21E</ac:FileId>
                        <ac:FileFormatCd>application/pdf</ac:FileFormatCd>
                        <ac:Attachments>
                            <ac:Attachment>
                                <ac:Document>
                                    <ac:DocumentReference>4960189</ac:DocumentReference>
                                    <ac:DocumentVersion/>
                                    <ac:FileId>Some Inc Acord 125_AllLOBS.pdf</ac:FileId>
                                    <ac:FileSize>
                                        <ac:NumUnits>117</ac:NumUnits>
                                        <ac:UnitMeasurementCd>KB</ac:UnitMeasurementCd>
                                    </ac:FileSize>
                                    <ac:DocumentTypeCd>correspondence</ac:DocumentTypeCd>
                                    <ac:Description>Some Inc Acord 125_AllLOBS</ac:Description>
                                </ac:Document>
                            </ac:Attachment>
                        </ac:Attachments>
                    </ac:AttachmentPackage>
                    <ac:AttachmentPackage>
                        <ac:Owner>
                            <ac:PartyId>urn:duns:043352368</ac:PartyId>
                            <ac:PartyRoleCd>Broker</ac:PartyRoleCd>
                        </ac:Owner>
                        <ac:CommunicationChannelCd>in_stream</ac:CommunicationChannelCd>
                        <ac:FileId>cid:803DE912-D553-41BC-8DA7-4357712EFA28</ac:FileId>
                        <ac:FileFormatCd>application/msword</ac:FileFormatCd>
                        <ac:Attachments>
                            <ac:Attachment>
                                <ac:Document>
                                    <ac:DocumentReference>4960190</ac:DocumentReference>
                                    <ac:DocumentVersion/>
                                    <ac:FileId>SomeDocumentName.doc</ac:FileId>
                                    <ac:FileSize>
                                        <ac:NumUnits>100</ac:NumUnits>
                                        <ac:UnitMeasurementCd>KB</ac:UnitMeasurementCd>
                                    </ac:FileSize>
                                    <ac:DocumentTypeCd>correspondence</ac:DocumentTypeCd>
                                    <ac:Description>SomeDocumentName
                                    </ac:Description>
                                </ac:Document>
                            </ac:Attachment>
                        </ac:Attachments>
                    </ac:AttachmentPackage>
                </ac:AttachmentPackages>
            </ac:WorkFolder>
        </ac:PostRq>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
